[
  "actions-uri",
  "calendar",
  "ollama",
  "obsidian-advanced-uri",
  "obsidian-excalidraw-plugin",
  "metadata-extractor",
  "table-editor-obsidian",
  "obsidian-banners",
  "obsidian-emoji-toolbar",
  "homepage",
  "dataview",
  "obsidian-tasks-plugin",
  "obsidian-icon-folder",
  "obsidian-style-settings",
  "templater-obsidian"
]